var juzi = [
  '遇见你，是我最美的邂逅。',
  '那一刻，我很想对已有往事说声、对不起。',
  '莫失莫忘，不离不弃。',
  '那句我喜欢你，温暖了我一整个冬季。',
  '任凭弱水三千，我只取一瓢饮。',
  '只要你需要，我就在这里。',
  '我希望和你并排站在一起，看每个黄昏日落。',
  '他们说，有风的地方。就是你爱着的人的灵魂在飞舞。',
  '喜欢就会放肆，但爱就是克制。',
  '我们都是单翅的天使，只有拥抱才能飞翔。',
  '不要活的太累，不要忙的太疲惫；想吃了不要嫌贵，想穿了不要说浪费；心烦了找朋友聚会，瞌睡了倒头就睡。心态平和永远最美，天天快乐才对！',
  '只要换你一次微笑，就算是做梦也会笑。',
  '爱，并非没有争执，而是在每次争执过后，爱仍在。',
  '我一直在关注你，用一切你知道或不知道的方式。',
  '爱着你，跟着你的志向一起飞翔，无论走了多久，永远微笑着在你怀里。',
  '玫瑰，你的；巧克力，你的；钻戒，你的；你，我的。',
  '能一直陪伴在你的身旁，那便是最美的天堂。',
  '爱情就像攥在手里的沙子，攥的越紧，流失的越快。',
  '我们的故事，一点也不长，却足以我用一辈子来释怀。',
  '当我向你倾诉我的烦恼，那不是抱怨，那是我对你的信任。',
  '喜欢一个人，就是在一起很开心；爱一个人，就是即使不开心，也想在一起。',
  '有时候，你想证明给一万个人看，到后来，你发现只得到了一个明白的人，那就够了。',
  '有些人浅薄，有些人金玉其外而败絮其中。可不经意间，有一天你会遇到一个彩虹般绚丽的人，从此以后，其他人就不过是匆匆浮云。',
  '真正的爱情，是跟一个关心你的人在一起，这个人可以让你表达内心的感受，在她身边，你也可以自由自在地谈论任何事情。',
  '我遇到过很多人。有人让我发烧，我以为那是爱情，结果烧坏了所有。有人让我发冷，从此消失在生命里。有人让我觉得温暖，但仅仅是温暖而已。只有你，让我的体温上升0.2℃。',
  '与你共度的时光，多久都不足够。',
  '我越是逃离，却越是靠近你。我越是背过脸，却越是看见你。我从你开始，我在你结束。',
  '你甚至还不认识我。我有一辈子可以认识你。',
  '我把我整个灵魂都给你，连同它的怪癖，耍小脾气，忽明忽暗，一千八百种坏毛病。它真讨厌，只有一点好，爱你。',
  '一想起你，我这张丑脸上就泛起微笑。',
  '你真好，我真爱你。可惜我不是诗人，说不出更动听的话了！',
  '我现在不坏了，我有了良心。我的良心就是你。',
  '她曾经说过，如果有一天我走丢了，就在原地等着，他会来找我。',
  '如果有一天我告诉你，好想你，那一定不是这天想你，而是这天忍不住了。',
  '原来他们早已情投意合，只是未遇到。遇到那天，一切都成了。',
  '最好的感觉，是有人懂你的欲言又止。',
  '眼睛为她下着雨，心却为她打着伞，这就是爱情。',
  '每想你一次，天上飘落一粒沙，从此形成了撒哈拉。 每想你一次，天上就掉下一滴水，于是形成了太平洋。',
  '你走，我不送你；你来，无论多大的风雨，我要去接你。',
  '我给你的备注是十二，朋友十二画，恋人十二画，爱人十二画，家人十二画。所以，十二的名字，叫做难忘。（十一叫做遗憾：比朋友少一点，比恋人少一点，比爱人少一点，比家人少一点。十三叫做偏爱：比朋友多一点，比恋人多一点，比爱人多一点，比家人多一点）',
  '双木非林，田下有心。',
  '见了他，她变得很低很低，低到尘埃里。但她心里是欢喜的，从尘埃里开出花来。',
  '有生之年能遇见你，竟花光我所有运气。',
  '我行过许多地方的桥，看过许多次数的云，喝过许多种类的酒，却只爱过一个正当最好年龄的人。',
  '你是一树一树的花开，是燕在梁间呢喃。你是爱，是暖，是希望，你是人间的四月天。',
  '哪个少年不多情，哪个少女不怀春。',
  '情不知所起，一往而深。',
  '世界这么大，人生这么长，总会有这么一个人，让你想要温柔地对待。',
  '女人有四种：或活泼，或敏感，或浪漫，或顽皮，任何一种女人，都有着独属于自己的味道，与魅力同在，与爱情同在。',
  '自从我习惯于沉迷在逻辑分析与理性辨证后，从未觉得情感竟然是如此的重要。',
  '最是那一低头的温柔，像一朵水莲花，不胜凉风的娇羞。',
  '于千万人之中，遇见你所遇见的人；于千万年之中，时间的无涯荒野里，没有早一步，也没有晚一步，刚巧赶上了。',
  '世人万千种，浮云莫去求，斯人若彩虹，遇上方知有。',
  '在白天对什么都不动感情是极为容易的，但在夜晚就是另外一回事了。',
  '初恋就是一点点笨拙外加许许多多好奇。',
  '我以往对你说过的一切最轻佻，最放荡的话，现在依然有效，我一句也不收回，我是无可救药的。',
  '山无陵，江水为竭。冬雷震震，夏雨雪。天地合，乃敢与君绝。',
  '愿得一心人，白头不相离。',
  '我希望有个如你一般的人，如山间清爽的风，如古城温暖的光，从清晨到夜晚 由山野到书房，只要最后是你，就好。',
  '你若不离不弃，我必生死相依。 我躲在街角等你，不想独自过圣诞节。',
  '最近有谣言说我喜欢你，我要澄清一下，那不是谣言。',
  '人间真话本不多,一个女子的脸红胜过一大段告白。',
  '有的人爱上小溪，是因为他没有见过大海。我已见过银河，但我只爱一颗星。',
  '夜阑卧听风吹雨，铁马是你，冰河也是你。',
  '从前的从前没有胭脂，女子的脸只为情郎红。',
  '第一眼见到他，我就疯狂地爱上了他。',
  '我一直在这里，等风又等你。',
  '不会说多醉人的情话，我只想带你回家。',
  '因为是你，所以我愿意。',
  '你口中的风景我都觉得好美丽，那是因为我喜欢你。',
  '我喜欢春天的花、夏天的树、秋天的黄昏、冬天的阳光和每天的你。',
  '始于颜值，忠于才华，陷于人品。',
  '平生不会相思，才会相思，便害相思。',
  '晓看天色暮看云，行也思君，坐也思君。',
]

var translateX = 0
var timerLunbo

function animate() {
  $('.text-carousel').html(
    `<span class="scroll-item"> <span class="fade-in">${juzi[translateX]}</span> </span>`
  )

  $('.scroll-item').css('animation-duration', `${juzi[translateX].length / 5}s`)

  translateX += 1
  if (translateX >= juzi.length) {
    translateX = 0
  }
}

function textLunbo() {
  animate()

  timerLunbo = setInterval(function () {
    animate()
  }, 10000)
}
